{ "Workout": [ {"WorkoutName" : "Bench Press" , "WorkoutGuide" : "Lie on your back on a flat bench. Grip a barbell with hands slightly wider than shoulder width. The bar should be directly over the shoulders. Press your feet firmly into the ground and keep your hips on the bench throughout the entire movement. Keep your core engaged and maintain a neutral spine position throughout the movement. Avoid arching your back. Slowly lift the bar or dumbbells off the rack, if using. Lower the bar to the chest, about nipple level, allowing elbows to bend out to the side, about 45 degrees away from the body. Stop lowering when your elbows are just below the bench. Press feet into the floor as you push the bar back up to return to starting position. Perform 10 reps, depending on weight used. Perform up to 4 sets." , "WorkoutReps" : "10" , "WorkoutSets" : "5" , "WorkoutWeights" : "70% 1RM" , "WorkoutRestTime" : "1:30", "WorkoutBodyPart" : "Chest", "WorkoutDifficulty" : "Moderate" , "WorkoutImageName" : "Barbell-Bench-Press" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=vcBig73ojpE&t=143s"}, {"WorkoutName" : "Chest Fly", "WorkoutGuide" : "Pick up the dumbbells off the floor using a neutral grip (palms facing in). Position the ends of the dumbbells in your hip crease, and sit down on the bench. To get into position, lay back and keep the weights close to your chest. Once you are in position, take a deep breath, then press the dumbbells to lockout at the top. Slightly retract your shoulder blades, unlock your elbows, and slowly lower the dumbbells laterally while maintaining the angle at your elbow. Once the dumbbells reach chest level, reverse the movement by squeezing your pecs together and bringing the dumbbells back to their starting position. Without allowing the dumbbells to touch, start the next repetition, and continue until the set is completed.""WorkoutReps" : "12","WorkoutSets" : "4","WorkoutWeights" : "50% 1RM","WorkoutRestTime" : "1:00","WorkoutBodyPart" : "Chest","WorkoutDifficulty" : "Easy","WorkoutImageName" : "Pec-Deck-Fly","WorkoutGuideAddress" : "https://www.youtube.com/watch?v=-EIhKMDSjBY"}, {"WorkoutName" : "Deadlift" , "WorkoutGuide" : "Walk to the bar. Stand with your mid-foot under the bar. Your shins shouldn’t touch it yet. Put your heels hip-width apart, narrower than on Squats. Point your toes out 15°. Grab the bar. Bend over without bending your legs. Grip the bar narrow, about shoulder-width apart like on the Overhead Press. Your arms must be vertical when looking from the front. Bend your knees. Drop into position by bending your knees until your shins touch the bar. Do NOT let the bar move away from your mid-foot. If it moves, start from scratch with step one. Lift your chest. Straighten your back by raising you chest. Do not change your position – keep the bar over your mid-foot, your shins against the bar, and your hips where they are. Pull. Take a big breath, hold it and stand up with the weight. Keep the bar in contact with your legs while you pull. Don’t shrug or lean back at the top. Lock your hips and knees." , "WorkoutReps" : "8" , "WorkoutSets" : "4" , "WorkoutWeights" : "75% 1RM" , "WorkoutRestTime" : "2:00", "WorkoutBodyPart" : "Back", "WorkoutDifficulty" : "Difficult" , "WorkoutImageName" : "Barbell-Deadlift" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=VL5Ab0T07e4"}, {"WorkoutName" : "Squat" , "WorkoutGuide" : "1. Stand with feet a little wider than hip width, toes facing front. 2. Drive your hips back—bending at the knees and ankles and pressing your knees slightly open—as you… 3. Sit into a squat position while still keeping your heels and toes on the ground, chest up and shoulders back. 4. Strive to eventually reach parallel, meaning knees are bent to a 90-degree angle. 5. Press into your heels and straighten legs to return to a standing upright position." , "WorkoutReps" : "8-10" , "WorkoutSets" : "4" , "WorkoutWeights" : "75% 1RM" , "WorkoutRestTime" : "1:30", "WorkoutBodyPart" : "Leg", "WorkoutDifficulty" : "Difficult" , "WorkoutImageName" : "Dumbbell-Lateral-Raise" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=v_ZkxWzYnMc"}, {"WorkoutName" : "Pull Up" , "WorkoutGuide" : "Grab the pullup bar with your palms down (shoulder-width grip) Hang to the pullup-bar with straight arms and your legs off the floor Pull yourself up by pulling your elbows down to the floor Go all the way up until your chin passes the be bar Lower yourself until your arms are straight" , "WorkoutReps" : "10" , "WorkoutSets" : "4" , "WorkoutWeights" : "bodyweight" , "WorkoutRestTime" : "1:00", "WorkoutBodyPart" : "Back", "WorkoutDifficulty" : "Moderate" , "WorkoutImageName" : "Pull-up" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=Hdc7Mw6BIEE"}, {"WorkoutName" : "Overhead Press" , "WorkoutGuide" : "Stand with the bar on your front shoulders, and your hands next to your shoulders Press the bar over your head, until it’s balanced over your shoulders and mid-foot Lock your elbows at the top, and shrug your shoulders to the ceiling." , "WorkoutReps" : "10" , "WorkoutSets" : "5" , "WorkoutWeights" : "70% 1RM" , "WorkoutRestTime" : "1:00", "WorkoutBodyPart" : "Shoulder", "WorkoutDifficulty" : "Moderate" , "WorkoutImageName" : "OverheadPress" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=_RlRDWO2jfg"}, {"WorkoutName" : "Side Lateral Raise" , "WorkoutGuide" : "The dumbbell lateral raise is a good exercise for building width in your upper body which gives you the V shape. Grab a set of dumbbells and stand straight up with the dumbbells at your sides. Your palms should be facing your body. You should be holding the dumbbells slightly off your body, as this keeps the tension on the side delts. This is your starting position for the exercise. To execute, slowly raise the dumbbells up to around shoulder height. It's important that you do not let your wrists go above your elbows while raising the weight, as this will take the work off the side delts and put it on the front delts. Pause at the top of the movement, and then slowly lower the weight back to the starting position. Do not let the dumbbells touch your body, and then raise them for the next rep." , "WorkoutReps" : "15" , "WorkoutSets" : "4" , "WorkoutWeights" : "20 lbs" , "WorkoutRestTime" : "1:00", "WorkoutBodyPart" : "Shoulder", "WorkoutDifficulty" : "Easy" , "WorkoutImageName" : "Dumbbell-Lateral-Raise" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=v_ZkxWzYnMc"}, {"WorkoutName" : "Leg Extension" , "WorkoutGuide" : "Place your hands on the hand bars. Lift the weight while exhaling until your legs are almost straight. Do not lock your knees. Keep your back against the backrest and do not arch your back. Exhale and lower the weight back to starting position. Do four sets of eight to 12 repetitions." , "WorkoutReps" : "12" , "WorkoutSets" : "4" , "WorkoutWeights" : "65% 1RM" , "WorkoutRestTime" : "1:00", "WorkoutBodyPart" : "Legs", "WorkoutDifficulty" : "Easy" , "WorkoutImageName" : "LEG-EXTENSION" , "WorkoutGuideAddress" : "https://www.youtube.com/watch?v=ljO4jkwv8wQ"}, ], "Status":"OK" }
